Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/civil_bill.html.txt.tmx
Source language: en
Languages: ga

source: The rules applying to setting down for trial are contained in Order 33 of the Circuit Court Rules
ga: Cuimsítear na rialacha a bhaineann le triail a chur síos in Ordú 33 de Rialacha na Cúirte Cuarda

source: The stamp duty that must be paid when a Civil Bill is issued is €130
ga: Is ionann an dleacht stampála nach mór a íoc nuair a eisítear Bille Sibhialta agus €130

source: There is no fee or stamp duty for entering an appearance
ga: Ní ghearrtar aon táille ná dleacht stampála chun láithreas a thaifeadadh

source: The stamp duty that must be paid for lodging a Defence notice with counterclaim is €15
ga: Is ionann an dleacht stampála nach mór a íoc nuair a sheoltar fógra Cosanta ar aghaidh le frithéileamh agus €15

source: A table of Circuit Court fees is available on the Courts Service website
ga: Tá fáil ar thábla de tháillí na Cúirte Cuarda ar láithreán gréasáin na Seirbhíse Cúirteanna

source: Your solicitor and barrister will charge fees for their services
ga: Gearrfaidh d’aturnae agus d’abhcóide táillí ar a gcuid seirbhísí

source: The rules applying to appearance, defence and counterclaim are contained in Order 15 of the Circuit Court Rules
ga: Cuimsítear na rialacha a bhaineann le láithreas, cosaint agus frithéileamh in Ordú 15 de Rialacha na Cúirte Cuarda

source: Further information on Circuit Court Rules and forms is available on the Courts Service website
ga: Tá fáil ar bhreis faisnéise ar Rialacha na Cúirte Cuarda agus ar fhoirmeacha ar láithreán gréasáin na Seirbhíse Cúirteanna
